Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailTransitionFailure Property
 Cannot create specified transition at rail path turn, hand Rail/Top Rail cannot maintain continuous.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailTransitionFailure { get; }
Public Shared ReadOnly Property ContinuousRailTransitionFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailTransitionFailure {
	FailureDefinitionId^ get ();
}
static member ContinuousRailTransitionFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace